src/cf/InformationRegisters/ДополнительныеСвойства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСвойства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДополнительныеРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеРеквизиты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Видимость</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доступность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязателен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Событие_ПриИзменении</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДополнительныеСвойства/Forms/ФормаРедактирования/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	Если Команда.Имя="Применить" Тогда
		ПрименитьНастройки();
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрименитьНастройки()
	НаборЗаписей=РегистрыСведений.ДополнительныеСвойства.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для каждого СтрокаКоллекции Из тпСвойства Цикл
		Если ЗначениеЗаполнено(СтрокаКоллекции.Значение) Тогда
			НоваяСтрока=НаборЗаписей.Добавить();
			НоваяСтрока.Ссылка=Ссылка;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКоллекции);
		КонецЕсли;
	КонецЦикла;

	НаборЗаписей.Записать();
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибута "тпСвойства"

&НаСервереБезКонтекста
Функция ТаблицаДополнительныхРеквизитовОбъекта(стрВладелец)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", УправлениеКонфигурациейСервер.ИдентификаторОбъектовМетаданныхСсылка(стрВладелец));
	Запрос.Текст="
	|ВЫБРАТЬ *,
	|	ИсточникДанных.Реквизит.Код КАК Код,
	|	ИсточникДанных.Реквизит.ТипЗначения КАК ТипЗначения
	|
	|ИЗ
	|	РегистрСведений.ДополнительныеРеквизиты КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.Владелец = &Владелец 
	|";
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

&НаСервере
Процедура тпСвойства_ДоступностьВидимость()
	стрИсточникДанных=стрЗаменить(Ссылка.Метаданные().ПолноеИмя(), ".", "_");;	

	тзРеквизитыОбъекта=ТаблицаДополнительныхРеквизитовОбъекта(стрИсточникДанных);
	Для каждого СтрокаКоллекции Из тзРеквизитыОбъекта Цикл
		стрНастройкиОтбора=СтрокаКоллекции["Видимость"];
		Если НЕ ПустаяСтрока(стрНастройкиОтбора) Тогда
			НастройкиОтбора=УниверсальныеМеханизмыСервер.ЗначениеИзСтрокиXML(стрНастройкиОтбора);
			СтрокаТабличнойЧасти=тпСвойства.НайтиСтроки(Новый Структура("Реквизит", СтрокаКоллекции.Реквизит))[0];
			//СтрокаТабличнойЧасти["Видимость"]=
			Если НЕ УправлениеКонфигурациейСервер.УсловиеВыполненоПоСсылке(Ссылка, НастройкиОтбора.Отбор) Тогда
				тпСвойства.Удалить(СтрокаТабличнойЧасти);
			КонецЕсли;			
		КонецЕсли;
		стрНастройкиОтбора=СтрокаКоллекции["Доступность"];
		Если НЕ ПустаяСтрока(стрНастройкиОтбора) Тогда
			НастройкиОтбора=УниверсальныеМеханизмыСервер.ЗначениеИзСтрокиXML(стрНастройкиОтбора);
			СтрокаТабличнойЧасти=тпСвойства.НайтиСтроки(Новый Структура("Реквизит", СтрокаКоллекции.Реквизит))[0];
			СтрокаТабличнойЧасти["Доступность"]=НЕ УправлениеКонфигурациейСервер.УсловиеВыполненоПоСсылке(Ссылка, НастройкиОтбора.Отбор);
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура тпСвойства_Инициализация()
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Владелец", УправлениеКонфигурациейСервер.ИдентификаторОбъектовМетаданныхСсылка(Ссылка.Метаданные().ПолноеИмя()));
	Запрос.Текст="
	//|ВЫБРАТЬ
	//|	ИсточникДанных.Реквизит КАК Реквизит,
	//|	ИсточникДанных.Отключен КАК Отключен,
	//|	Неопределено КАК Значение
	//|ИЗ
	//|	РегистрСведений.ДополнительныеРеквизиты КАК ИсточникДанных
	//|ГДЕ
	//|	ИсточникДанных.Владелец = &Владелец 
	////|	И НЕ ИсточникДанных.Отключен
	//|
	//|Объединить все
	//|
	//|ВЫБРАТЬ
	//|	ИсточникДанных.Реквизит КАК Реквизит,
	//|	Ложь КАК Отключен,
	//|	ИсточникДанных.Значение КАК Значение
	//|ИЗ
	//|	РегистрСведений.ДополнительныеСвойства КАК ИсточникДанных
	//|ГДЕ
	//|	ИсточникДанных.Ссылка = &Ссылка
	//|";
	
	|ВЫБРАТЬ
	|	ДополнительныеРеквизиты.Реквизит КАК Реквизит,
	|	ДополнительныеРеквизиты.Отключен КАК Отключен,
	|	ДополнительныеСвойства.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|	ЛЕВОЕ СОЕДИНЕНИЕ (
	|       Выбрать *
	|		ИЗ
	|			РегистрСведений.ДополнительныеСвойства КАК Свойства
	|		ГДЕ
	|			Свойства.Ссылка = &Ссылка	
	|		) Как ДополнительныеСвойства
	|		ПО ДополнительныеРеквизиты.Реквизит = ДополнительныеСвойства.Реквизит
	|ГДЕ
	|	ДополнительныеРеквизиты.Владелец = &Владелец
	|";
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(тпСвойства.Добавить(), Выборка);
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Ссылка", Ссылка);
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда СтандартнаяОбработка=Ложь; Возврат; КонецЕсли;
	
	тпСвойства_Инициализация();
	тпСвойства_ДоступностьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если тпСвойства.Количество()=0 Тогда
		ПоказатьПредупреждение(, "Объект не имеет свойств", 20, "Внимание"); Отказ=Истина;
	КонецЕсли;
КонецПроцедуры
